Repository: OmranEdoo/portefolio
Catalog: src/language/*/app.po
Languages: fr

source: _about
fr: _à propos

source: _play
fr: _jouer

source: _projects
fr: _projets

source: A (very) amateur chess player...
fr: Joueur d'échecs (très) amateur...

source: ABOUT
fr: À propos

source: Engineering school graduate...
fr: Diplomé d'école d'ingénieur...

source: For this project, we experiment the AGILE ans SCRUM methodologie. We were divided in two teams : the backend and the frontend. I was part of the backend teams, I've work with a lot of subjects including 3D data import and processing.
fr: Pour ce projet, nous avons expérimenté les méthodologies AGILE et SCRUM. Nous étions divisés en deux équipes : le backend et le frontend. Je faisais partie de l'équipe backend, j'ai travaillé sur de nombreux sujets dont l'importation et le traitement de données 3D.

source: Freelance developer...
fr: Développeur freelance...

source: Hi! I'm a passionate developer with a background in geomatics engineering. A creator at heart, I'm always looking for new ways to solve problems through programming.
fr: Salut, je suis un développeur passionné ayant fait une formation en ingénierie géomatique. Créateur dans l'âme, je suis toujours à la recherche de nouvelles façons de résoudre les problèmes via la programmation.

source: I learned 3D programmation in engineering school with OpenGL and WebGL. For the project, i've used the library ThreeJs.
fr: J'ai appris la programmation 3D en école d'ingénieur avec OpenGL et WebGL. Pour ce projet, j'ai utilisé la bibliothèque ThreeJs.

source: loading
fr: chargement

source: MiniGIS is a GIS Desktop application capable of displaying, manipulating, and analyzing the various forms of spatial data. MiniGIS supports Vector and Raster data format. The data represented in the application will come from web feeds, existing databases, or files from local or remote repositories.
fr: MiniGIS est une application SIG de bureau capable d'afficher, de manipuler et d'analyser les différentes formes de données spatiales. MiniGIS prend en charge les formats de données vectorielles et matricielles. Les données représentées dans l'application proviendront de flux web, de bases de données existantes ou de fichiers provenant de dépôts locaux ou distants.

source: Projects
fr: Projets

source: Resume
fr: CV

source: The application provides clear, accurate 2D and 2D + 1 visualisation of data, as well as spatio-temporal analysis of trajectories. It is easy for users to learn, thanks to the various aids provided.
fr: L'application permet une visualisation claire et précise des données en 2D et 2D + 1, ainsi qu'une analyse spatio-temporelle des trajectoires. ainsi que l'analyse spatio-temporelle des trajectoires. Elle est facile d'utilisation pour les utilisateurs, grâce aux différentes aides fournies.

source: The main challenge is to find an effective way of visualising this data and providing analysis tools for race organisers and researchers interested in the data collected. To meet this challenge, the project proposes the development of a high-performance web application capable of representing the evolution of participant's pace as a function of different parameters.
fr: Le principal défi est de trouver un moyen efficace de visualiser ces données et de fournir des outils d'analyse aux organisateurs de courses et aux chercheurs intéressés par les données collectées. Pour répondre à ce défi, le projet propose le développement d'une application web performante capable de représenter l'évolution de l'allure des participants en fonction de différents paramètres.

source: The TrailLove76200 project aims to visualise the trajectories of participants in the Oxfam Trailwalker 2021 race and to provide a spatio-temporal analysis of these trajectories.
fr: Le projet TrailLove76200 vise à visualiser les trajectoires des participants à la course Oxfam Trailwalker 2021 et à fournir une analyse spatio-temporelle de ces trajectoires.

source: This project was a school project made with the 17 ENSG students. It consists of developing a 2D/3D GIS using C++, Qt and OpenGL.
fr: Ce projet est un projet scolaire réalisé avec les 17 étudiants de l'ENSG. Il consiste à développer un SIG 2D/3D en utilisant C++, Qt et OpenGL.

source: This Website is a brief presentation of wy work. It was made with the frameworks Vue3 and Vuex.
fr: Ce site web est une brève présentation de notre travail. Il a été réalisé avec les frameworks Vue3 et Vuex.

source: Welcome on my portefolio website !
fr: Bienvenue sur mon site portefolio !

source: When I'm not coding, I like playing soccer, climbing, running or playing chess.
fr: Lorsque je ne code pas, j'aime jouer au football, faire de l'escalade, courir ou jouer aux échecs.
